Revit 2026 API
AssemblyInstance.CompareAssemblyInstances Method
 Compares two assembly instances and returns a result with details about the differences
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static AssemblyDifference CompareAssemblyInstances(
	AssemblyInstance instance1,
	AssemblyInstance instance2
)
Public Shared Function CompareAssemblyInstances (
	instance1 As AssemblyInstance,
	instance2 As AssemblyInstance
) As AssemblyDifference
public:
static AssemblyDifference^ CompareAssemblyInstances(
	AssemblyInstance^ instance1,
	AssemblyInstance^ instance2
)
static member CompareAssemblyInstances :
        instance1 : AssemblyInstance *
        instance2 : AssemblyInstance -> AssemblyDifference
Parameters
instance1 AssemblyInstance
 The first assembly instance to compare
instance2 AssemblyInstance
 the second assembly instance to compare
Return Value
AssemblyDifference
 An object describing the difference between the two instances
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Only the first found difference is returned. If the instances are identical, AssemblyDifferenceNone will be returned.
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace